{
  "job advertisement": "When a company wants to hire new employees, they will post a _ _ online, in newspapers, or other public places where people can read it and learn about the job.",
  "resume": "curriculum vitae is another word for _.",
  "curriculum vitae": "Resume is another word for _ _.",
  "cover letter": "When you send a job application, you usually include a _ _.",
  "human resources": "Typically, job applications are handled by the department of _ _.",
  "accomplishments": "Your CV includes information about your _, or in other words, the good things that you have achieved.",
  "sales representative": "Many company employees start their career as a _ _.",
  "rejection": "If your job application is unsuccessful, you will probably receive a _ email or letter.",
  "reception area": "When you go to a company for a job interview, first you will probably go to the _ _, where the secretary will receive you.",
  "long-term career plans": "During a job interview, you might be asked about your _ _ _ _; for example, where do you see yourself in five years time?",
  "deadline": "Every job application will have a _, after which the company will no longer accept applicants.",
  "short-listed": "She was one of five lawyers _ for the two job openings.",
  "contribute": "The manager _ substantially to the organization.",
  "candidate": "She's the best _ for the job because she has a lot of experience.",
  "ASAP": "My meeting starts in 10 minutes so I need to leave _.",
  "nightmare": "A bad dream is called a _.",
  "Phew!": "_ is a sound you make when you feel relieved.",
  "sales figures": "Company sales representatives need to keep track of their _ _, or the data that measures how much they sell.",
  "remembering names": "I am good at _ _ because when I first meet someone, I always say their name aloud several times to help me remember.",
  "client": "_ is a more professional word for customer.",
  "err...": "In English, when thinking, we often use the sound _ when thinking.",
  "spill food": "You will have to change your shirt if you _ _ on it.",
  "train platform": "The _ _ is the place to where you get on and off the train.",
  "supervisor": "A _ is a person above you who helps to guide your work like a boss.",
  "complain": "When you don't like something, you may very well _.",
  "paperwork": "I have to work late because I need to catch up on some _.",
  "this is terrible": "If something is going really bad, you can say, _ _ _.",
  "floor plan": "The _ _ of the office was well designed to maximize efficiency.",
  "partnership deal": "A _ _ is an agreement between two companies.",
  "Does that work for you?": "When you want to ask someone if they are ok with something, or if a particular time is suitable for them, you might say: _ _ _ _ _?",
  "slides": "The pages in PowerPoint are called _ because they look like that old analog technology.",
  "rehearse": "Before a presentation, you should _, or practice presentation so that it goes smoothly.",
  "to sum up": "_ _ _, is another way to say, in conclusion.",
  "clicker": "A _ is a remote control used to change slides when presenting.",
  "overview": "At the beginning of a presentation, it is a good idea to give an _ of the presentation contents.",
  "jargon": "Technical words, which are used in very specific contexts, are sometimes referred to as _.",
  "interrupt": "It is rude to _ someone during a presentation or while they are speaking.",
  "bullet-point": "When creating PowerPoint slides, we often use _ to make a list.",
  "audience": "The _ is a group of people watching or listening to a presentation.",
  "launch": "To start selling a new product is called the _.",
  "animation": "It is not a good practice to use _ to make your slides move.",
  "projected": "The total number a company expects to sell is called the _ sales.",
  "attend": "To go to a meeting is to _ the meeting.",
  "agenda": "An _ is a list of topics to be discussed or covered during a meeting.",
  "chairing": "The chairperson is responsible for _, or conducting a meeting.",
  "items": "The topics listed on an agenda are often called _.",
  "yawn": "You might open your mouth and _ when you feel tired.",
  "promotion": "A _ is an activity to improve or increase sales.",
  "cross their arms": "Some people _ _ _ when they are being serious.",
  "delay": "If someone or something is behind schedule, it is _.",
  "impact": "An _ is a strong effect or influence on something or someone.",
  "minutes": "The written record of a meeting (e.g., who said what) is called the _.",
  "participants": "The people who take part in a meeting are called _.",
  "moving on": "When you have finished a point that you are talking about and want to move to another topic, you might say, “_ _”.",
  "online banners": "Digital marketing advertisements that appear on a web page are called _ _.",
  "awful": "When something is really bad, we say that it is _.",
  "urgent": "You need to reply to an email ASAP if it is _.",
  "Best regards": "_ is a very useful expression for finishing email.",
  "get to the point": "Instead of writing a long email, you need to _ _ _ _ quickly and say the most important information early.",
  "formal": "In business emails, you should use more _ language, and avoid using language that is too casual.",
  "typos": "You should check you emails carefully for _, or mistakes before you click send.",
  "emojis": "_ are images we use in an email or text message to show our feeling about something; for example, a smily face for happy.",
  "Sincere apologies": "_ _ is a polite and formal way to say sorry.",
  "Ms.": "_ is a very useful title to refer to women because it does not depend on their married status.",
  "forward": "To _ an email to someone means that you send them a copy of an email that you have already sent or received.",
  "draft": "When I want to continue working on an email, I save a _ to finish later.",
  "casual": "_ language is more relaxed. It is the kind of language we use with friends and family.",
  "thread": "A _ is a copy of all previous email or message on the same subject, usual in order they were sent.",
  "bullet train": "In Japan, the _ _ is a very fast, comfortable and convenient way to travel.",
  "vegetarian": "People who don't eat meat are called _, because they only eat vegetables.",
  "book": "When you want to go to a nice restaurant, it is a good idea to _ a table in advance, or in other words, to make a reservation.",
  "Can I join you": "\"_ _ _ _?\" is a good expression to use when you want to sit down together with someone.",
  "hot and humid": "In Japan, the summer is very _ _ _.",
  "Chinese-American": "A _ is an American citizen whose background is from China; for example, maybe their parents moved from China to America.",
  "small-talk": "I'm not very good at _ with people because I never know what to talk about.",
  "right": "All Americans love baseball, _?",
  "full": "We cannot go into this restaurant because it is _.",
  "goodbyes": "At the end of our visit, we said our _.",
  "sake": "Japanese people love _, don't they?",
  "non-smoker": "I think he is a _ because I have never seen him smoking.",
  "carry-on": "The luggage that you bring onto a plane is called, _ luggage.",
  "charger": "A _ is a device used to put the electricity into other devices.",
  "boarding pass": "You need a _ _ in order to go onto a plane.",
  "On top of that": "_ _ _ _, is another way to say, additionally, also, or furthermore.",
  "jet lag": "When you take a flight to another country in a different time zone, you might feel _ _.",
  "immigration": "_ is the area at an airport where officers check your passport and landing card before you enter their country.",
  "landing card": "When you enter another country, you need to fill out and submit a _ _ at immigration with information about you, your passport number, flight number, etc.",
  "bet": "A: Ms. Tanaka was really angry with me. B: Yeah, I _.",
  "check-in counter": "When you go to an airport to take a flight, you will first go to the _ _ to check in to your flight.",
  "used to": "I am so _ _ leaving things on the table because in Japan we do it all the time.",
  "baggage carousel": "After getting off a plane, you usually collect your luggage from the _ _.",
  "travel lightly": "To travel with little or no luggage is to _ _."
}
